{"Hall_effect_sensor": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/7/7e/Hall_sensor_tach.gif\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>A <b>Hall effect sensor</b> is any sensor incorporating one or more Hall elements, each of which produces a voltage proportional to one axial component of the <span>magnetic field vector <span class=\"texhtml \"><b>B</b></span></span> using the Hall effect.</p>", "Speedometer": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Toyota_Corolla_2016_speedometer.jpg/330px-Toyota_Corolla_2016_speedometer.jpg\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>A <b>speedometer</b> or <b>speed meter</b> is a gauge that measures and displays the instantaneous speed of a vehicle. Now universally fitted to motor vehicles, they started to be available as options in the early 20th century, and as standard equipment from about 1910 onwards. Other vehicles may use devices analogous to the speedometer with different means of sensing speed, eg. boats use a pit log, while aircraft use an airspeed indicator.</p>", "Inductance": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/VFPt_Solenoid_correct2.svg/330px-VFPt_Solenoid_correct2.svg.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p><b>Inductance</b> is the tendency of an electrical conductor to oppose a change in the electric current flowing through it. The electric current produces a magnetic field around the conductor. The magnetic field strength depends on the magnitude of the electric current, and therefore follows any changes in the magnitude of the current. From Faraday's law of induction, any change in magnetic field through a circuit induces an electromotive force (EMF) (voltage) in the conductors, a process known as electromagnetic induction. This induced voltage created by the changing current has the effect of opposing the change in current. This is stated by Lenz's law, and the voltage is called <i>back EMF</i>.</p>", "Modal_testing": "<p><b>Modal testing</b> is the form of vibration testing of an object whereby the natural (modal) frequencies, modal masses, modal damping ratios and mode shapes of the object under test are determined.</p>", "Backward_Euler_method": "<p>In numerical analysis and scientific computing, the <b>backward Euler method</b> is one of the most basic numerical methods for the solution of ordinary differential equations. It is similar to the (standard) Euler method, but differs in that it is an implicit method. The backward Euler method has error of order one in time.</p>", "Routh%E2%80%93Hurwitz_stability_criterion": "<p>In the control system theory, the <b>Routh–Hurwitz stability criterion</b> is a mathematical test that is a necessary and sufficient condition for the stability of a linear time-invariant (LTI) dynamical system or control system. A stable system is one whose output signal is bounded; the position, velocity or energy do not increase to infinity as time goes on. The Routh test is an efficient recursive algorithm that English mathematician Edward John Routh proposed in 1876 to determine whether all the roots of the characteristic polynomial of a linear system have negative real parts. German mathematician Adolf Hurwitz independently proposed in 1895 to arrange the coefficients of the polynomial into a square matrix, called the Hurwitz matrix, and showed that the polynomial is stable if and only if the sequence of determinants of its principal submatrices are all positive. The two procedures are equivalent, with the Routh test providing a more efficient way to compute the Hurwitz determinants than computing them directly. A polynomial satisfying the Routh–Hurwitz criterion is called a Hurwitz polynomial.</p>", "Trapezoidal_rule": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Trapezoidal_rule_illustration.svg/330px-Trapezoidal_rule_illustration.svg.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>In calculus, the <b>trapezoidal rule</b> is a technique for numerical integration, i.e. approximating the definite integral:\n<span class=\"mwe-math-element mwe-math-element-block\"><img src=\"https://wikimedia.org/api/rest_v1/media/math/render/svg/249ee3fdbced31dfc328ff357f67bb134ca66b8d\" class=\"mwe-math-fallback-image-display mw-invert skin-invert\" aria-hidden=\"true\" style=\"vertical-align:-2.338ex;width:11.786ex;height:6.343ex\" /></span></p>", "DC-to-DC_converter": "<p>A <b>DC-to-DC converter</b> is an electronic circuit or electromechanical device that converts a source of direct current (DC) from one voltage level to another. It is a type of electric power converter. Power levels range from very low to very high.</p>", "Ruffini%27s_rule": "<p>In mathematics, <b>Ruffini's rule</b> is a method for computation of the Euclidean division of a polynomial by a binomial of the form <i>x − r</i>. It was described by Paolo Ruffini in 1809. The rule is a special case of synthetic division in which the divisor is a linear monic factor.</p>", "Sum_of_two_cubes": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Sum_and_difference_of_2_cubes.svg/330px-Sum_and_difference_of_2_cubes.svg.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>In mathematics, the <b>sum of two cubes</b> is a cubed number added to another cubed number.</p>", "Euler_method": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Euler_method.svg/330px-Euler_method.svg.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>In mathematics and computational science, the <b>Euler method</b> is a first-order numerical procedure for solving ordinary differential equations (ODEs) with a given initial value. It is the most basic explicit method for numerical integration of ordinary differential equations and is the simplest Runge–Kutta method. The Euler method is named after Leonhard Euler, who first proposed it in his book <i>Institutionum calculi integralis</i>.</p>"}